{"id":"44c7e57a-8ae4-4333-ac33-19d9dfef8cfc","updated_at":"2025-03-10T07:15:51.096Z","updated_by":"yousef","created_at":"2025-03-10T07:05:32.895Z","created_by":"yousef","name":"SIGMA - Creation of a Startup, Logon or a One time Scheduled Task","tags":[],"interval":"5m","enabled":true,"revision":2,"description":"Detects the creation of scheduled tasks that are configured to run at startup, logon, or a one time using schtasks.exe or cmd.exe. This can be indicative of persistence mechanisms used by attackers.","risk_score":47,"severity":"medium","note":"1. Check the executable in the scheduled task.\n2. Verify its purpose by origin, and associated files to determine if its execution is legitimate and expected.","license":"Basic","output_index":"","meta":{"from":"1m","kibana_siem_app_url":""},"author":["Yousef M.Helmy"],"false_positives":["Administrative activity","Scripts and administrative tools used in the monitored environment"],"from":"now-360s","rule_id":"2617e7ed-adb7-40ba-b0f3-8f9985fe6c09","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":["https://www.atomicredteam.io/atomic-red-team/atomics/T1053.005#atomic-test-1---scheduled-task-startup-script","https://www.atomicredteam.io/atomic-red-team/atomics/T1053.005#atomic-test-2---scheduled-task-local","https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks","https://pentestlab.blog/2019/11/04/persistence-scheduled-tasks/"],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[{"package":"windows","version":"^2.3.6"}],"required_fields":[],"setup":"","type":"query","language":"lucene","index":["winlogbeat-*","logs-endpoint.events.process-*","logs-windows.sysmon_operational-*"],"query":"((process.executable:(*\\\\schtasks.exe OR *\\\\cmd.exe OR *\\\\powershell.exe)) OR (OriginalFilename:(schtasks.exe OR cmd.exe OR powershell.exe))) AND ((process.command_line:(*\\ \\/Create\\ * OR *\\ SCHTASKS\\ * OR *\\ ONCE*)) OR (process.command_line:(*\\ onlogon\\ * OR *\\ onstart\\ * OR *\\ \\/create*))) AND (NOT (*\\ \\/delete\\ * OR *\\ \\/Delete*))","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
